{
  "version": "1.0.0",
  "patterns": [
    {
      "id": "clean-diagonal",
      "title": "Strong Diagonal",
      "description": "A bright, continuous line running from top-left to bottom-right. This is the normal intra-chromosomal Hi-C signal — contigs within the same chromosome show strong contact frequency along the diagonal.",
      "whatToLookFor": "Bright continuous diagonal line with gradual fade-off perpendicular to the diagonal.",
      "specimenId": "koala",
      "exampleRegion": { "x1": 0.0, "y1": 0.0, "x2": 0.15, "y2": 0.15 }
    },
    {
      "id": "chromosome-block",
      "title": "Chromosome Block",
      "description": "Square blocks along the diagonal, each representing one chromosome. Within a block, contigs have high mutual contact frequency. Between blocks, contact is much lower — this is how Hi-C reveals chromosome boundaries.",
      "whatToLookFor": "Distinct square regions of bright signal along the diagonal, separated by darker gaps.",
      "specimenId": "wrasse",
      "exampleRegion": { "x1": 0.0, "y1": 0.0, "x2": 0.3, "y2": 0.3 }
    },
    {
      "id": "inversion",
      "title": "Inversion (Butterfly)",
      "description": "An anti-diagonal 'butterfly' or 'bowtie' pattern at a misassembly breakpoint. This occurs when a contig segment is inverted relative to its true orientation, creating a characteristic X-shaped signal at the junction.",
      "whatToLookFor": "X-shaped or butterfly pattern where the diagonal signal briefly reverses direction.",
      "specimenId": "finch",
      "exampleRegion": { "x1": 0.2, "y1": 0.2, "x2": 0.35, "y2": 0.35 }
    },
    {
      "id": "translocation",
      "title": "Translocation",
      "description": "An off-diagonal bright block indicates contigs from different chromosomes that have been incorrectly joined in the assembly. In a correct assembly, off-diagonal signal should be minimal.",
      "whatToLookFor": "Bright rectangular block away from the main diagonal, connecting two different chromosome regions.",
      "specimenId": "finch",
      "exampleRegion": { "x1": 0.1, "y1": 0.4, "x2": 0.25, "y2": 0.55 }
    },
    {
      "id": "microchromosomes",
      "title": "Microchromosomes",
      "description": "Many small blocks along the diagonal, common in birds and some reptiles. Bird karyotypes have numerous small microchromosomes (often 10-40), which appear as tiny bright squares near the bottom-right of the map.",
      "whatToLookFor": "Cluster of many small bright squares near the end of the diagonal.",
      "specimenId": "quail",
      "exampleRegion": { "x1": 0.6, "y1": 0.6, "x2": 0.95, "y2": 0.95 }
    },
    {
      "id": "sparse-signal",
      "title": "Low Coverage",
      "description": "Faint or grey regions indicate low Hi-C read depth. This can happen with repetitive sequences, heterochromatin, or assembly gaps. These regions are harder to curate because the signal-to-noise ratio is poor.",
      "whatToLookFor": "Pale or nearly invisible regions along the diagonal where the contact signal is weak.",
      "specimenId": "finch",
      "exampleRegion": { "x1": 0.7, "y1": 0.7, "x2": 0.9, "y2": 0.9 }
    },
    {
      "id": "unplaced-contigs",
      "title": "Unplaced Contigs",
      "description": "Small, scattered fragments typically found at the bottom-right of an uncurated map. These contigs couldn't be placed into chromosomes by the assembler and often need manual assignment during curation.",
      "whatToLookFor": "Cluster of tiny, isolated dots or very small blocks at the bottom-right corner.",
      "specimenId": "quail",
      "exampleRegion": { "x1": 0.85, "y1": 0.85, "x2": 1.0, "y2": 1.0 }
    },
    {
      "id": "compartments",
      "title": "A/B Compartments",
      "description": "A plaid or checkerboard pattern within chromosomes caused by the spatial organization of active (A) and inactive (B) chromatin compartments. This is a normal biological signal, not a misassembly.",
      "whatToLookFor": "Checkerboard-like alternating bright and dark patches within a chromosome block.",
      "specimenId": "koala",
      "exampleRegion": { "x1": 0.0, "y1": 0.0, "x2": 0.12, "y2": 0.12 }
    }
  ]
}
